ConnectTest/src/Catalogs/matchingRequestsInformationSources/matchingRequestsInformationSources.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>matchingRequestsInformationSources</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>compressAnswer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>defaultResponse</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>mockServerMode</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>notSaveAnswer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>performBackground</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>staffOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>informationSources</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>compressAnswer</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>HTTPRequestType</name>
      <type>
        <types>EnumRef.HTTPRequestTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>informationSource</name>
      <type>
        <types>CatalogRef.informationSources</types>
      </type>
    </attributes>
    <attributes>
      <name>mockServerMode</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>notSaveAnswer</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>notUse</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>performBackground</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>requestReceiver</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>requestSource</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>staffOnly</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ConnectTest/src/Catalogs/matchingRequestsInformationSources/ObjectModule.bsl
Procedure BeforeWrite(Cancel)
	For Each row In informationSources Do
		row.requestSource = Code;
		row.performBackground = performBackground;
		row.staffOnly = staffOnly;
		row.notSaveAnswer = notSaveAnswer;
		row.mockServerMode = mockServerMode;
	EndDo;
EndProcedure
